// © Copyright 2012-2017 HP Development Company, L.P.

SATTaskName = "Status and Alerts";

MoreInfoTitle = "More Information";
SATPrivacyStatementOnlineLink = "HP Privacy Statement";

SATAlertsTaskDescription = "Specify the level of extended status information you want to see for your HP device. You will always be notified if the device is unable to complete a task that you have requested, or if your attention is required.";

SATShowAlertsButtonTitle = "Show extended alerts for:";
SATAutoDismissTitlePreffix = "Automatically dismiss alerts in";
SATAutoDismissTitleSuffix = "second(s) for:";

SATErrorsWarningsAndInfo = "errors, warnings and informational messages";
SATErrorsAndWarnings = "errors and warnings";
SATErrorsOnly = "errors only";
SATInfoMessages = "informational messages";
SATWarningsAndInfoMessages = "warnings and informational messages";

SATShowWebContentButtonTitle = "Show web content in alerts";
SATShowWebContentButtonBaseDescription = "With your permission, the status of your device can be securely shared with HP. When provided this information HP can check to see if you are enrolled in an HP program or eligible for special offers, and modify the alert based on available options.";
SATShowWebContentButtonMoreInfoFootnote = "SAT_TEXT:* To learn more about the information sent to HP, see SAT_KEYED_LINK:MoreInfoTitle.";
SATShowWebContentButtonPrivacyStatementFootnote = "SAT_TEXT:* To learn more about HP’s Privacy Policy, see SAT_LINK:SATPrivacyStatementOnlineLink.";

SATNoControlPanelAlertTitle = "Are you sure you want to turn off HP Alerts?";
SATNoControlPanelTurnOffButtonTitle = "Turn Off";
SATNoControlPanelAlertText = "If you do, you risk not seeing important messages about the status of your device.";
SATCancelButtonTitle = "Cancel";
